; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v8 ?v6)
		(pred_2 ?v4)
		(pred_6 ?v3)
		(pred_1 ?v3)
		(pred_3 ?v4 ?v3)
		(pred_5)
		(pred_4 ?v4))

   (:action op_3
       :parameters  (?v1 ?v2)
       :precondition (and (not-eq ?v1 ?v2) 
                          (pred_6 ?v1) (pred_6 ?v2) (pred_1 ?v1))
       :effect (and  (pred_1 ?v2)
		     (not (pred_1 ?v1))))


   (:action op_1
       :parameters (?v7 ?v5)
       :precondition  (and  (pred_2 ?v7) (pred_6 ?v5)
			    (pred_3 ?v7 ?v5) (pred_1 ?v5) (pred_5))
       :effect (and (pred_4 ?v7)
		    (not (pred_3 ?v7 ?v5)) 
		    (not (pred_5))))

   (:action op_2
       :parameters  (?v7  ?v5)
       :precondition  (and  (pred_2 ?v7) (pred_6 ?v5)
			    (pred_4 ?v7) (pred_1 ?v5))
       :effect (and (pred_3 ?v7 ?v5)
		    (pred_5)
		    (not (pred_4 ?v7)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_06 obj_02 obj_03 
          obj_01 obj_04 obj_05 
)
(:init
(pred_6 obj_06)
(pred_6 obj_02)
(pred_6 obj_03)
(pred_2 obj_01)
(pred_2 obj_04)
(pred_2 obj_05)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(pred_5)
(pred_3 obj_01 obj_03)
(pred_3 obj_04 obj_03)
(pred_3 obj_05 obj_02)
(pred_1 obj_06)
)
(:goal
(and
(pred_3 obj_01 obj_06)
(pred_3 obj_04 obj_06)
(pred_3 obj_05 obj_02)
)
)

(:constraints
  (and
    (sometime-before  (pred_3 obj_01 obj_06) (pred_1 obj_02))
    (sometime-before  (pred_3 obj_04 obj_06) (pred_1 obj_02))
  )
)
)

; plan
1. (op_3 obj_06 obj_03)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_03)
   goals met: 1 of 3
2. (op_1 obj_04 obj_03)
   deleted: (pred_3 obj_04 obj_03) (pred_5)
   added: (pred_4 obj_04)
   goals met: 1 of 3
3. (op_3 obj_03 obj_02)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_02)
   goals met: 1 of 3
4. (op_2 obj_04 obj_02)
   deleted: (pred_4 obj_04)
   added: (pred_3 obj_04 obj_02) (pred_5)
   goals met: 1 of 3
5. (op_3 obj_02 obj_03)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_03)
   goals met: 1 of 3
6. (op_1 obj_01 obj_03)
   deleted: (pred_3 obj_01 obj_03) (pred_5)
   added: (pred_4 obj_01)
   goals met: 1 of 3
7. (op_3 obj_03 obj_06)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_06)
   goals met: 1 of 3
8. (op_2 obj_01 obj_06)
   deleted: (pred_4 obj_01)
   added: (pred_3 obj_01 obj_06) (pred_5)
   goals met: 2 of 3
9. (op_3 obj_06 obj_02)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_02)
   goals met: 2 of 3
10. (op_1 obj_04 obj_02)
   deleted: (pred_3 obj_04 obj_02) (pred_5)
   added: (pred_4 obj_04)
   goals met: 2 of 3
11. (op_3 obj_02 obj_06)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_06)
   goals met: 2 of 3
12. (op_2 obj_04 obj_06)
   deleted: (pred_4 obj_04)
   added: (pred_3 obj_04 obj_06) (pred_5)
   goals met: 3 of 3
